20260209193633-sales_growth_meeting_9th.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-30 Mon 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sales growth meeting 9th</title>
<meta name="author" content="Vipul" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sales growth meeting 9th</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org418aa35">Slide 1: Title (2 min)</a>
<ul>
<li><a href="#orgb0b8096">Daily Sales Growth via Human Psychology &amp; Better Thinking</a></li>
</ul>
</li>
<li><a href="#org9a2273f">Slide 2: Context – Why This Session? (4 min)</a>
<ul>
<li><a href="#org9932134">Our Reality at The Purchase House</a></li>
</ul>
</li>
<li><a href="#orga41cf9c">Slide 3: From Features to Human Psychology (4 min)</a>
<ul>
<li><a href="#orge671933">People Decide Emotionally, Justify Rationally</a></li>
</ul>
</li>
<li><a href="#org3e9e808">Slide 4: Negotiation – Human Psychology, Not Drama (4 min)</a>
<ul>
<li><a href="#orgd4a0d12">Simple Negotiation Concepts</a></li>
</ul>
</li>
<li><a href="#org67126c0">Slide 5: WhatsApp as Our Main Weapon (4 min)</a>
<ul>
<li><a href="#orga6e7e36">Best Practices for Non‑Technical Team</a></li>
</ul>
</li>
<li><a href="#orgc4aabc3">Slide 6: AI and the “Genie” Problem (5 min)</a>
<ul>
<li><a href="#orgcc6c89e">Writing and Thinking for Clarity</a></li>
<li><a href="#orgf7b14da">Leveraging AI for Business Operations</a></li>
</ul>
</li>
<li><a href="#org55b62b8">Slide 7: Mental Arithmetics That Help in Sales (3 min)</a>
<ul>
<li><a href="#orgeda1d1c">“Meri Aatma Tumhe Hamesha Satayegi”</a></li>
</ul>
</li>
<li><a href="#org5a3b939">Slide 8: Turning Rejection into Data, Not Drama (3 min)</a>
<ul>
<li><a href="#org0a2dc90">From Emotional Reaction → Analysis</a></li>
</ul>
</li>
<li><a href="#orgb6f654a">Slide 9: Simple Daily Routine for the Team (2 min)</a>
<ul>
<li><a href="#org584f0eb">10–15 Minutes of “High‑Quality Improvement”</a></li>
</ul>
</li>
<li><a href="#orge78f085">Slide 10: Key Takeaways (2 min)</a>
<ul>
<li><a href="#orgc55d4c4">What I Want You to Remember</a></li>
</ul>
</li>
<li><a href="#orgf2f867b">Slide 11: Next Steps &amp; Q&amp;A (2 min)</a>
<ul>
<li><a href="#org5c32ebd">Next Steps for Our Team</a></li>
<li><a href="#org3962555">Q&amp;A</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org418aa35" class="outline-2">
<h2 id="org418aa35">Slide 1: Title (2 min)</h2>
<div class="outline-text-2" id="text-org418aa35">
</div>
<div id="outline-container-orgb0b8096" class="outline-3">
<h3 id="orgb0b8096">Daily Sales Growth via Human Psychology &amp; Better Thinking</h3>
<div class="outline-text-3" id="text-orgb0b8096">
<ul class="org-ul">
<li>Goal: How to sell more, think better, and stay mentally tough – even without technical background.</li>
<li>This is a practical 30‑minute session: psychology, AI, numbers, mindset.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9a2273f" class="outline-2">
<h2 id="org9a2273f">Slide 2: Context – Why This Session? (4 min)</h2>
<div class="outline-text-2" id="text-org9a2273f">
</div>
<div id="outline-container-org9932134" class="outline-3">
<h3 id="org9932134">Our Reality at The Purchase House</h3>
<div class="outline-text-3" id="text-org9932134">
<ul class="org-ul">
<li>Huge variety of machines and huge buying requirements.</li>
<li>Our Sales team is a mix of tech and non‑tech; even engineers need time to understand our specs.</li>
<li>Result:
<ul class="org-ul">
<li>Confusion → hesitation → lost deals</li>
<li>Focus on “features” instead of <b>customer problems</b></li>
</ul></li>
<li>Today’s focus:
<ul class="org-ul">
<li>Use human psychology + simple analysis instead of deep technical knowledge.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga41cf9c" class="outline-2">
<h2 id="orga41cf9c">Slide 3: From Features to Human Psychology (4 min)</h2>
<div class="outline-text-2" id="text-orga41cf9c">
</div>
<div id="outline-container-orge671933" class="outline-3">
<h3 id="orge671933">People Decide Emotionally, Justify Rationally</h3>
<div class="outline-text-3" id="text-orge671933">
<ul class="org-ul">
<li>Customers don’t buy “machines”; they buy:
<ul class="org-ul">
<li>Fewer breakdowns</li>
<li>Faster delivery</li>
<li>Risk reduction</li>
<li>Respect / status in their factory</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e9e808" class="outline-2">
<h2 id="org3e9e808">Slide 4: Negotiation – Human Psychology, Not Drama (4 min)</h2>
<div class="outline-text-2" id="text-org3e9e808">
</div>
<div id="outline-container-orgd4a0d12" class="outline-3">
<h3 id="orgd4a0d12">Simple Negotiation Concepts</h3>
<div class="outline-text-3" id="text-orgd4a0d12">
<ul class="org-ul">
<li>BATNA (Best Alternative To a Negotiated Agreement):
<ul class="org-ul">
<li>Know our walk‑away point: price, special terms, delivery time, accessories,</li>
</ul></li>
<li>Win‑win frame:
<ul class="org-ul">
<li>“Let’s see how we can keep the deal value same but try to add more value from the machine seller.”</li>
</ul></li>
<li>Psychological tactics to <b>avoid</b>:
<ul class="org-ul">
<li>Bluffing about non‑existent buyers</li>
<li>Last‑minute emotional pressure</li>
</ul></li>
<li>Aim: <b>long‑term repeat</b> customers, not one‑time wins.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org67126c0" class="outline-2">
<h2 id="org67126c0">Slide 5: WhatsApp as Our Main Weapon (4 min)</h2>
<div class="outline-text-2" id="text-org67126c0">
</div>
<div id="outline-container-orga6e7e36" class="outline-3">
<h3 id="orga6e7e36">Best Practices for Non‑Technical Team</h3>
<div class="outline-text-3" id="text-orga6e7e36">
<ul class="org-ul">
<li>Message structure:
<ol class="org-ol">
<li>Mention context:
<ul class="org-ul">
<li>“Sir, as discussed – machine options for mild steel cutting…”</li>
</ul></li>
<li>Make important points <b><b>bold</b></b>.</li>
<li>Use bullet points instead of long paragraphs.</li>
<li>Highlight 2–3 key deciding points.</li>
<li>For negative replies, use the sandwich method:
<ul class="org-ul">
<li>Start with something positive</li>
<li>Mention the negative answer</li>
<li>Close with a positive or neutral point.</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc4aabc3" class="outline-2">
<h2 id="orgc4aabc3">Slide 6: AI and the “Genie” Problem (5 min)</h2>
<div class="outline-text-2" id="text-orgc4aabc3">
</div>
<div id="outline-container-orgcc6c89e" class="outline-3">
<h3 id="orgcc6c89e">Writing and Thinking for Clarity</h3>
<div class="outline-text-3" id="text-orgcc6c89e">
<ul class="org-ul">
<li>Mimicry vs. thinking:
<ul class="org-ul">
<li>AI can mimic style, but not your unique way of thinking and extrapolating situations.</li>
</ul></li>
<li>The “genie” problem:
<ul class="org-ul">
<li>AI and employees are like literal genies: without specific context, they fill gaps with <b>their</b> context.</li>
</ul></li>
<li>Bottleneck identification:
<ul class="org-ul">
<li>Most business bottlenecks are “missing spec” (unclear instructions), not missing skill.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf7b14da" class="outline-3">
<h3 id="orgf7b14da">Leveraging AI for Business Operations</h3>
<div class="outline-text-3" id="text-orgf7b14da">
<ul class="org-ul">
<li>Deep research:
<ul class="org-ul">
<li>Use AI to list edge cases: equipment, staffing, process checklists.</li>
<li>Always verify for hallucinations or outdated info.</li>
</ul></li>
<li>Designing incentives:
<ul class="org-ul">
<li>Ask AI for examples of global sales incentive structures, then adapt to your team.</li>
</ul></li>
<li>Mood‑boarding and referencing:
<ul class="org-ul">
<li>Use AI to generate many references (visuals, scripts, angles) so the team aligns on a vision before execution.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org55b62b8" class="outline-2">
<h2 id="org55b62b8">Slide 7: Mental Arithmetics That Help in Sales (3 min)</h2>
<div class="outline-text-2" id="text-org55b62b8">
</div>
<div id="outline-container-orgeda1d1c" class="outline-3">
<h3 id="orgeda1d1c">“Meri Aatma Tumhe Hamesha Satayegi”</h3>
<div class="outline-text-3" id="text-orgeda1d1c">
<ul class="org-ul">
<li>While in negotiation stage, you should be able to quickly estimate:
<ul class="org-ul">
<li>Buyer’s charges</li>
<li>Seller’s charges</li>
<li>Transport cost</li>
<li>Lifting / rigging cost</li>
</ul></li>
<li>In addition, you should be aware of:
<ul class="org-ul">
<li>Approximate reserve value of buyer</li>
<li>Approximate reserve value of seller</li>
</ul></li>
<li>Goal: rough order of magnitude so you don’t agree to stupid deals.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5a3b939" class="outline-2">
<h2 id="org5a3b939">Slide 8: Turning Rejection into Data, Not Drama (3 min)</h2>
<div class="outline-text-2" id="text-org5a3b939">
</div>
<div id="outline-container-org0a2dc90" class="outline-3">
<h3 id="org0a2dc90">From Emotional Reaction → Analysis</h3>
<div class="outline-text-3" id="text-org0a2dc90">
<ul class="org-ul">
<li>After a lost deal, ask 3 questions:
<ol class="org-ol">
<li>Was it price, trust, timing, or product‑fit?</li>
<li>Did the customer clearly understand our value vs alternative?</li>
<li>What can I change in my next 10 calls based on this?</li>
</ol></li>
<li>Treat each “No” like a failed trek route:
<ul class="org-ul">
<li>Learn, adjust, and attempt the next deal smarter.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb6f654a" class="outline-2">
<h2 id="orgb6f654a">Slide 9: Simple Daily Routine for the Team (2 min)</h2>
<div class="outline-text-2" id="text-orgb6f654a">
</div>
<div id="outline-container-org584f0eb" class="outline-3">
<h3 id="org584f0eb">10–15 Minutes of “High‑Quality Improvement”</h3>
<div class="outline-text-3" id="text-org584f0eb">
<ul class="org-ul">
<li>At the end of the day:
<ul class="org-ul">
<li>Write down:
<ul class="org-ul">
<li>1 thing that worked</li>
<li>1 mistake</li>
<li>1 experiment for tomorrow</li>
</ul></li>
</ul></li>
<li>Small daily improvement in thinking and behavior → compounding over months.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge78f085" class="outline-2">
<h2 id="orge78f085">Slide 10: Key Takeaways (2 min)</h2>
<div class="outline-text-2" id="text-orge78f085">
</div>
<div id="outline-container-orgc55d4c4" class="outline-3">
<h3 id="orgc55d4c4">What I Want You to Remember</h3>
<div class="outline-text-3" id="text-orgc55d4c4">
<ul class="org-ul">
<li>You don’t need deep technical knowledge to sell:
<ul class="org-ul">
<li>You need to understand <b>people</b> and <b>simple numbers</b>.</li>
</ul></li>
<li>Use:
<ul class="org-ul">
<li>Reciprocity, social proof, consistency, loss aversion – in ethical ways.</li>
<li>Simple mental math + clarity in WhatsApp.</li>
</ul></li>
<li>Quote from Munger:
<ul class="org-ul">
<li>“It is remarkable how much long‑term advantage people like us have gotten
by trying to be consistently not stupid, instead of trying to be very intelligent.”</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf2f867b" class="outline-2">
<h2 id="orgf2f867b">Slide 11: Next Steps &amp; Q&amp;A (2 min)</h2>
<div class="outline-text-2" id="text-orgf2f867b">
</div>
<div id="outline-container-org5c32ebd" class="outline-3">
<h3 id="org5c32ebd">Next Steps for Our Team</h3>
<div class="outline-text-3" id="text-org5c32ebd">
<ul class="org-ul">
<li>From you, I expect:
<ul class="org-ul">
<li>1 new psychological tactic tested in your calls this week.</li>
<li>1 written reflection on a deal you lost and what you learned.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3962555" class="outline-3">
<h3 id="org3962555">Q&amp;A</h3>
<div class="outline-text-3" id="text-org3962555">
<ul class="org-ul">
<li>Questions, objections, and ideas from you.</li>
<li>Let’s discuss 1–2 real deals you are handling now and apply these concepts live.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>